[
  {
    "name": "Municipal Fee Assistance Program (MFAP)",
    "category": "financial",
    "description": "Provides discounted access to City recreation programs, transit passes, garbage tags, and other municipal services for low-income Kingston residents. Also provides access to partner services like dental care, vision care, and Lionhearts Fresh Food Market discounts.",
    "eligibility": "Kingston residents with household income below the Low Income Measure (LIM) + 15% threshold. Must provide proof of income and Kingston residency.",
    "phone": "613-546-2695 ext 4906",
    "address": "362 Montreal Street, Kingston, ON",
    "how_to_apply": "Visit the Housing & Social Services office at 362 Montreal Street with proof of income (tax return or NOA), government-issued ID, and proof of Kingston residency (utility bill). Application is reviewed on the spot.",
    "website": "https://www.cityofkingston.ca/residents/community-services/municipal-fee-assistance",
    "hours": "Monday-Friday, 8:30 AM - 4:30 PM",
    "cost": "Free to apply. Unlocks discounted services.",
    "notes": "MFAP card is valid for one year and must be renewed annually. The card unlocks: discounted recreation programs, reduced transit passes, free garbage tags, dental coverage, vision care, and $10 off at Lionhearts Fresh Food Market.",
    "keywords": ["fee assistance", "low income", "discount", "recreation", "transit pass", "dental", "vision", "food", "garbage tags", "financial help"]
  },
  {
    "name": "Canadian Dental Care Program (CDCP)",
    "category": "health",
    "description": "Federal program providing free routine dental services for eligible Canadian seniors aged 65 and older with adjusted family net income under $70,000 and no existing private dental insurance.",
    "eligibility": "Canadian residents aged 65+, adjusted family net income under $70,000, no private dental insurance. Highest coverage for income under $70,000.",
    "phone": "1-833-537-4342",
    "address": "Apply by phone or online at canada.ca/dental",
    "how_to_apply": "Call 1-833-537-4342 or visit canada.ca/dental. You will need your Social Insurance Number and income information. Service Canada will verify eligibility. Once approved, you receive a letter and can visit any participating dentist.",
    "website": "https://www.canada.ca/en/services/benefits/dental/dental-care-plan.html",
    "cost": "Free for eligible seniors",
    "notes": "Covers: routine cleanings, fillings, dentures, X-rays, emergency dental work, oral surgery. Processing takes 4-8 weeks. Many Kingston dentists participate.",
    "keywords": ["dental", "teeth", "dentist", "dentures", "cleaning", "oral health", "CDCP", "free dental", "senior dental"]
  },
  {
    "name": "Subsidized Homemaking Services",
    "category": "housing",
    "description": "City of Kingston provides subsidized homemaking services through Comfort Keepers Kingston for older adults and people with disabilities who need help maintaining their home.",
    "eligibility": "Kingston residents who are older adults or have a disability. Housing and Social Services reviews finances to determine subsidy level.",
    "phone": "613-634-2273",
    "address": "Comfort Keepers Kingston, 12-1786 Bath Road, Kingston, ON",
    "how_to_apply": "Contact Comfort Keepers directly at 613-634-2273 or call the City's Housing & Social Services at 613-546-2695. A financial review determines your subsidy level.",
    "website": "https://www.cityofkingston.ca/residents/community-services/homemaking-services",
    "cost": "Subsidized — cost depends on financial review",
    "notes": "Services include: light housekeeping, laundry, meal preparation, grocery shopping, and personal care assistance. Currently has a WAITLIST due to high demand. Apply early.",
    "keywords": ["homemaking", "cleaning", "housekeeping", "laundry", "meals", "home help", "home care", "disability", "aging in place"]
  },
  {
    "name": "Kingston Transit",
    "category": "transit",
    "description": "Kingston Transit operates 45 bus routes with 891 stops across the city. Seniors 65+ receive discounted fares. MFAP cardholders get further reduced transit passes.",
    "eligibility": "Open to all. Seniors 65+ get reduced fare. MFAP cardholders get discounted monthly passes.",
    "phone": "613-546-0000 (City of Kingston main line)",
    "address": "Kingston Transit terminal at Division and Princess Street",
    "how_to_apply": "Purchase tickets/passes at the Kingston Transit terminal, City Hall, or select retailers. For senior rates, show government-issued ID with date of birth.",
    "website": "https://www.kingstontransit.ca",
    "cost": "Regular fare: $3.25. Senior fare: $2.25. Monthly pass (senior): $62.00. MFAP monthly pass: reduced rate.",
    "notes": "Real-time GTFS data available. Routes run Monday-Saturday approximately 6:00 AM to midnight, with reduced Sunday service. Kingston Access Services provides accessible transportation for those who cannot use regular transit.",
    "keywords": ["bus", "transit", "transportation", "route", "schedule", "bus pass", "getting around", "ride"]
  },
  {
    "name": "SPARK Recreation Subsidy",
    "category": "recreation",
    "description": "Provides up to $300 per year toward registered recreation programs for Kingston residents with low income. Available through MFAP.",
    "eligibility": "Kingston residents with an active MFAP card.",
    "phone": "613-546-2695 ext 4906",
    "address": "362 Montreal Street, Kingston, ON",
    "how_to_apply": "First, obtain an MFAP card. Then register for city recreation programs and the SPARK subsidy will be applied automatically up to $300/year.",
    "cost": "Up to $300/year in recreation program subsidies",
    "notes": "Covers swimming, fitness classes, arts programs, and other registered city recreation activities. Must have MFAP card first.",
    "keywords": ["recreation", "swimming", "fitness", "activities", "sports", "exercise", "programs", "SPARK", "subsidy"]
  },
  {
    "name": "Kingston Seniors Association",
    "category": "recreation",
    "description": "Provides social programs, activities, and support services for older adults in Kingston. Includes the Home Maintenance and Repair Program for seniors.",
    "eligibility": "Kingston residents aged 55+",
    "phone": "613-548-7810",
    "address": "56 Francis Street, Kingston, ON",
    "how_to_apply": "Contact the Seniors Association directly or visit their office. Annual membership fee applies but is affordable.",
    "website": "https://www.kingstonseniors.ca",
    "notes": "Programs include: computer training, social events, exercise classes, art workshops, day trips, and the Home Maintenance and Repair Program (minor home repairs for seniors at low cost).",
    "keywords": ["seniors", "social", "activities", "home repair", "maintenance", "community", "friends", "loneliness"]
  },
  {
    "name": "Affordable Housing Programs",
    "category": "housing",
    "description": "City of Kingston manages social housing waitlist and affordable housing programs including rent-geared-to-income housing, Ontario Renovates (home modifications for seniors and accessibility), and the Housing First program.",
    "eligibility": "Kingston residents with low income. Specific criteria vary by program.",
    "phone": "613-546-2695",
    "address": "362 Montreal Street, Kingston, ON",
    "how_to_apply": "Apply through Housing & Social Services. Social housing has a centralized waitlist. Ontario Renovates has periodic intake windows.",
    "website": "https://www.cityofkingston.ca/residents/community-services/housing",
    "notes": "Social housing waitlist can be lengthy (months to years). Ontario Renovates provides grants/loans for home accessibility modifications (ramps, grab bars, stairlifts). Priority given to seniors and those with disabilities.",
    "keywords": ["housing", "rent", "affordable", "social housing", "apartment", "renovations", "accessibility", "ramp", "grab bars"]
  },
  {
    "name": "Community Centres & Recreation",
    "category": "recreation",
    "description": "Kingston operates multiple community centres offering programs specifically designed for older adults, including fitness classes, arts programs, social events, and drop-in activities.",
    "eligibility": "Open to all Kingston residents. Discounted rates for seniors and MFAP cardholders.",
    "phone": "613-546-0000",
    "address": "Multiple locations: Artillery Park (352 Bagot St), Rideau Heights (85 Maccauley St), Calvin Park (87 Cooke Dr), INVISTA Centre (1350 Gardiners Rd)",
    "how_to_apply": "Register online at cityofkingston.ca/recreation or in person at any community centre.",
    "website": "https://www.cityofkingston.ca/residents/recreation",
    "notes": "Popular senior programs: aquafit, gentle yoga, pickleball, painting, line dancing, bridge clubs. Many centres also offer free drop-in social hours for seniors.",
    "keywords": ["recreation", "community centre", "fitness", "yoga", "swimming", "arts", "social", "programs", "drop-in"]
  },
  {
    "name": "211 Ontario",
    "category": "all",
    "description": "Free, confidential helpline that connects people to community and social services across Ontario. Available 24/7 by phone, chat, or web. Covers: food banks, mental health, financial assistance, housing, employment, and more.",
    "eligibility": "Open to all Ontario residents",
    "phone": "211 (dial 2-1-1) or 1-877-330-3213",
    "website": "https://211ontario.ca",
    "notes": "If you're unsure where to start, 211 is a great first step. Trained specialists can help identify all services you may qualify for.",
    "keywords": ["211", "help", "social services", "food bank", "mental health", "don't know where to start", "general help"]
  },
  {
    "name": "Low-Income Health Benefits",
    "category": "health",
    "description": "Through MFAP, eligible Kingston residents can access dental care, vision care, and prescription drug coverage at reduced or no cost through partner providers.",
    "eligibility": "Kingston residents with an active MFAP card",
    "phone": "613-546-2695 ext 4906",
    "how_to_apply": "Obtain an MFAP card first, then access health benefits through approved partner providers.",
    "notes": "Covers: basic dental (cleanings, fillings, extractions), eye exams, prescription eyeglasses, and some prescription medications.",
    "keywords": ["health", "dental", "vision", "glasses", "prescription", "medication", "doctor", "medical"]
  },
  {
    "name": "Lionhearts Fresh Food Market",
    "category": "food",
    "description": "Provides discounted fresh food (produce, dairy, bread, protein) to MFAP cardholders at multiple Kingston locations. $10 discount on purchases.",
    "eligibility": "Kingston residents with an active MFAP card",
    "phone": "613-507-7993",
    "address": "Multiple Kingston locations — check website for nearest market day",
    "website": "https://www.lionheartsinc.com",
    "cost": "$10 discount with MFAP card",
    "notes": "Markets operate on specific days at different locations. Fresh, high-quality food at affordable prices. Accepting MFAP is automatic — just show your card.",
    "keywords": ["food", "groceries", "fresh food", "produce", "discount food", "affordable food", "market", "hungry", "eat"]
  },
  {
    "name": "Kingston Access Services",
    "category": "transit",
    "description": "Specialized accessible transportation service for Kingston residents who cannot use regular Kingston Transit due to a disability.",
    "eligibility": "Kingston residents with a disability that prevents use of conventional transit. Requires application and eligibility assessment.",
    "phone": "613-546-2637",
    "how_to_apply": "Complete an application form available from Kingston Transit. An eligibility assessment may be required.",
    "website": "https://www.kingstontransit.ca/accessibility",
    "cost": "Same fare as regular Kingston Transit",
    "notes": "Door-to-door service. Must book rides in advance (at least 24 hours). Available during regular transit hours.",
    "keywords": ["accessible transit", "wheelchair", "disability", "door to door", "accessible transportation", "mobility"]
  }
]
